src/test/resources/messages/iti-42-invalid-token.xml

<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:8081/services/registry/iti42</To><Action S:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RegisterDocumentSet-b</Action><ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
    <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
</ReplyTo><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:6ef9acae-583c-4b55-940e-8934d097d902</MessageID><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" S:mustUnderstand="true"><saml2:Assertion xmlns:del="urn:oasis:names:tc:SAML:2.0:conditions:delegation" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:hl7v3="urn:hl7-org:v3" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xacml="urn:oasis:names:tc:xacml:2.0:policy:schema:os" xmlns:xacml-context="urn:oasis:names:tc:xacml:2.0:context:schema:os" xmlns:xacml-saml="urn:oasis:names:tc:xacml:2.0:profile:saml2.0:v2:schema:assertion" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ID="_4ce011c5-681d-482f-a59c-d17e09842f6c" IssueInstant="2024-09-25T14:45:40.759Z" Version="2.0"><saml2:Issuer>urn:oid:1.2.4</saml2:Issuer><ds:Signature><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/><ds:Reference URI="#_4ce011c5-681d-482f-a59c-d17e09842f6c"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>cd3NCQKZLZR7vx30EwbE3RJypbf2dHI3zIkTKQMeXVA=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>bthUvyFnxDxz3fdsxyRJMz49NQ4GdkVjHMmZo17Ko112S/Z6Zxf8MtanD6chokwTV+MkYXsTZ5r1&#xd;
    dmp63wiYK/WsVL7mTyKFxFx2OTntZmh/3I+eAVKMHDYQ4sCvrok077n2MN55bzvm7qVUR+uoWLCZ&#xd;
    WWcB2p3jf0T4WlAaDx6KI0kQoWpDqrH8GILoQbz4nEuo8kXvSOL8qi4iZFvuKuEAWT9yUGD/ElBa&#xd;
    EKHIrJzfE7jk5tqNFHQViAj0Nn3ID4J/FkE7mH2QANL3cwEvl4nCWa6znrwa9QR4ci1oICGOMERc&#xd;
    VtCjg6m3sPlxx8AeJFCxJFSaHId36hUAxGHP5A==</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>cert</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature><saml2:Subject><saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">ihe-test-service</saml2:NameID><saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"><saml2:SubjectConfirmationData NotBefore="2024-09-25T14:45:34.759Z" NotOnOrAfter="2024-09-25T14:46:40.759Z" Recipient="https://audien.ce"/></saml2:SubjectConfirmation></saml2:Subject><saml2:Conditions NotBefore="2024-09-25T14:45:34.759Z" NotOnOrAfter="2024-09-25T14:46:40.759Z"><saml2:AudienceRestriction><saml2:Audience>https://audien.ce</saml2:Audience></saml2:AudienceRestriction></saml2:Conditions><saml2:AuthnStatement AuthnInstant="2024-09-25T14:45:40.759Z"><saml2:AuthnContext><saml2:AuthnContextClassRef>urn:x-ipf:System</saml2:AuthnContextClassRef></saml2:AuthnContext></saml2:AuthnStatement><saml2:AttributeStatement><saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role"/></saml2:AttributeStatement></saml2:Assertion></wsse:Security></S:Header><S:Body><lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0"><RegistryObjectList xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"><ExtrinsicObject id="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e542" lid="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e541" mimeType="application/pdf" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1"><Slot name="creationTime"><ValueList><Value>20190824072000</Value></ValueList></Slot><Slot name="hash"><ValueList><Value>e9612c419177762d3488e6c507ad6bbec2d61747</Value></ValueList></Slot><Slot name="languageCode"><ValueList><Value>de-DE</Value></ValueList></Slot><Slot name="legalAuthenticator"><ValueList><Value>^Musterfrau^Martha^^^Dr</Value></ValueList></Slot><Slot name="repositoryUniqueId"><ValueList><Value>1.2.11</Value></ValueList></Slot><Slot name="serviceStartTime"><ValueList><Value>20190823032400</Value></ValueList></Slot><Slot name="size"><ValueList><Value>3278</Value></ValueList></Slot><Slot name="sourcePatientId"><ValueList><Value>4712^^^&amp;1.2.276.0.76.3.1.324.2.1&amp;ISO</Value></ValueList></Slot><Slot name="urn:ihe:iti:xds:2013:referenceIdList"><ValueList><Value>case-id-1^^^&amp;1.2.3&amp;ISO^urn:ihe:iti:xds:2015:encounterId</Value></ValueList></Slot><Name><LocalizedString value="Arztbrief"/></Name><Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e542" id="urn:uuid:2d00d89e-99ce-4137-83c0-1bcdc3cf2f5e" lid="urn:uuid:2d00d89e-99ce-4137-83c0-1bcdc3cf2f5e" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="authorPerson"><ValueList><Value>^Musterfrau^Martha^^^Dr</Value></ValueList></Slot><Slot name="authorInstitution"><ValueList><Value>Städt. Krankenhaus OS^^^^^^^^^1.2.276.0.76.3.1.324</Value></ValueList></Slot><Slot name="authorRole"><ValueList><Value>"6;Betreuer; 1.3.6.1.4.1.19376.3.276.1.5.13"</Value></ValueList></Slot><Slot name="authorSpecialty"><ValueList><Value>"150;FA Neurochirurgie;1.2.276.0.76.5.114"</Value></ValueList></Slot></Classification><Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e542" nodeRepresentation="VER" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.8</Value></ValueList></Slot><Name><LocalizedString value="Verordnung"/></Name></Classification><Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e542" id="urn:uuid:0b932017-f919-4dae-b140-0a8854a3d903" lid="urn:uuid:0b932017-f919-4dae-b140-0a8854a3d903" nodeRepresentation="N" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>2.16.840.1.113883.5.25</Value></ValueList></Slot><Name><LocalizedString value="normal"/></Name></Classification><Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e542" nodeRepresentation="urn:ihe-d:spec:PDF_A1:2005" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.6</Value></ValueList></Slot><Name><LocalizedString value="PDF/A-1"/></Name></Classification><Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e542" nodeRepresentation="KHS" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.2</Value></ValueList></Slot><Name><LocalizedString value="Krankenhaus"/></Name></Classification><Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e542" nodeRepresentation="INNE" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.4</Value></ValueList></Slot><Name><LocalizedString value="Innere Medizin"/></Name></Classification><Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e542" nodeRepresentation="MEDI" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.9</Value></ValueList></Slot><Name><LocalizedString value="Medikamentöse Therapien"/></Name></Classification><ExternalIdentifier identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e542" value="4712^^^&amp;1.2.276.0.76.3.1.324.2.1&amp;ISO"><Name><LocalizedString value="XDSDocumentEntry.patientId"/></Name></ExternalIdentifier><ExternalIdentifier identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e542" value="1.2.276.0.76.3.1.324.12.1.1^0099563"><Name><LocalizedString value="XDSDocumentEntry.uniqueId"/></Name></ExternalIdentifier></ExtrinsicObject><RegistryPackage id="urn:uuid:815ba03b-e395-4f09-bf9b-8df33ebb982d" lid="urn:uuid:815ba03b-e395-4f09-bf9b-8df33ebb982d" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage"><Slot name="submissionTime"><ValueList><Value>20240925144540</Value></ValueList></Slot><Name><LocalizedString value="Laborbericht"/></Name><Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="urn:uuid:815ba03b-e395-4f09-bf9b-8df33ebb982d" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"/><Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="urn:uuid:815ba03b-e395-4f09-bf9b-8df33ebb982d" id="urn:uuid:9736064d-62ba-4749-8597-d2ed7ace86ad" lid="urn:uuid:9736064d-62ba-4749-8597-d2ed7ace86ad" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="authorPerson"><ValueList><Value>^Boer^Henk^^^Dr</Value></ValueList></Slot><Slot name="authorInstitution"><ValueList><Value>Krankenhaus^^^^^^^^^1.2.276.0.76.3.1.324</Value></ValueList></Slot><Slot name="authorRole"><ValueList><Value>"6;Betreuer; 1.3.6.1.4.1.19376.3.276.1.5.13"</Value></ValueList></Slot><Slot name="authorSpecialty"><ValueList><Value>"150;FA Neurochirurgie;1.2.276.0.76.5.114"</Value></ValueList></Slot></Classification><Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="urn:uuid:815ba03b-e395-4f09-bf9b-8df33ebb982d" nodeRepresentation="5" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.12</Value></ValueList></Slot><Name><LocalizedString value="Aufnahme"/></Name></Classification><ExternalIdentifier identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:815ba03b-e395-4f09-bf9b-8df33ebb982d" value="4712^^^&amp;1.2.276.0.76.3.1.324.2.1&amp;ISO"><Name><LocalizedString value="XDSSubmissionSet.patientId"/></Name></ExternalIdentifier><ExternalIdentifier identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:815ba03b-e395-4f09-bf9b-8df33ebb982d" value="1.2.276.0.76.3.1.324.12.3.1"><Name><LocalizedString value="XDSSubmissionSet.sourceId"/></Name></ExternalIdentifier><ExternalIdentifier identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:815ba03b-e395-4f09-bf9b-8df33ebb982d" value="2.25.171946160400812589950998674392840116269"><Name><LocalizedString value="XDSSubmissionSet.uniqueId"/></Name></ExternalIdentifier></RegistryPackage><Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association" sourceObject="urn:uuid:815ba03b-e395-4f09-bf9b-8df33ebb982d" targetObject="urn:uuid:5162d183-cfce-4c7b-be6b-10278f43e542"><Slot name="SubmissionSetStatus"><ValueList><Value>Original</Value></ValueList></Slot></Association></RegistryObjectList></lcm:SubmitObjectsRequest></S:Body></S:Envelope>
