app/src/main/assets/deprecateDocuments.mustache

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:Action s:mustUnderstand="1">urn:ihe:iti:2010:UpdateDocumentSet</wsa:Action>
		<wsa:MessageID s:mustUnderstand="1">{{MESSAGE_UUID}}</wsa:MessageID>
	</s:Header>
	<s:Body>
		<lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
			<rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
				<!-- SubmissionSet -->
				<rim:RegistryPackage id="{{SUBMISSION_SET_ENTRY_UUID}}" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
					<!-- SubmissionSet.submissionTime -->
					<rim:Slot name="submissionTime">
						<rim:ValueList>
							<rim:Value>{{SUBMISSION_SET_SUBMISSION_TIME}}</rim:Value>
						</rim:ValueList>
					</rim:Slot>
					<!-- SubmissionSet.contentTypeCode -->
					<rim:Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="{{SUBMISSION_SET_ENTRY_UUID}}" id="{{SUBMISSION_SET_CONTENT_TYPE_CODE_UUID}}" nodeRepresentation="*" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
						<rim:Slot name="codingScheme">
							<rim:ValueList>
								<rim:Value>2.16.840.1.113883.6.1</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<rim:Name>
							<rim:LocalizedString value="*"/>
						</rim:Name>
					</rim:Classification>
					<!-- SubmissionSet Classification -->
					<rim:Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="{{SUBMISSION_SET_ENTRY_UUID}}" id="{{SUBMISSION_SET_CLASSIFICATION_UUID}}" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"/>
					<!-- SubmissionSet.sourceId -->
					<rim:ExternalIdentifier id="{{SUBMISSION_SET_SOURCE_ID_UUID}}" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:99ad4a61-d69f-4c8e-a994-7fda1c567b97" value="1.3.6.1.4.1.21367.2012.2.1.1">
						<rim:Name>
							<rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
						</rim:Name>
					</rim:ExternalIdentifier>
					<!-- SubmissionSet.uniqueId -->
					<rim:ExternalIdentifier id="{{SUBMISSION_SET_UNIQUE_ID_UUID}}" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="{{SUBMISSION_SET_ENTRY_UUID}}" value="{{SUBMISSION_SET_UNIQUE_ID_VALUE}}">
						<rim:Name>
							<rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
						</rim:Name>
					</rim:ExternalIdentifier>
					<!-- SubmissionSet.patientId -->
					<rim:ExternalIdentifier id="{{SUBMISSION_SET_PATIENT_ID_UUID}}" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="{{SUBMISSION_SET_ENTRY_UUID}}" value="{{PATIENT_ID}}">
						<rim:Name>
							<rim:LocalizedString value="XDSSubmissionSet.patientId"/>
						</rim:Name>
					</rim:ExternalIdentifier>
				</rim:RegistryPackage>

				<!-- UpdateAvailabiltyStatus : SubmissionSet to DocumentEntry -->
				<rim:Association id="{{ASSOCIATION_SUBMISSION_SET_OLD_DOCUMENT_UUID}}" associationType="urn:ihe:iti:2010:AssociationType:UpdateAvailabilityStatus" sourceObject="{{SUBMISSION_SET_ENTRY_UUID}}" targetObject="{{OLD_DOCUMENT_ENTRY_UUID}}">
					<rim:Slot name="NewStatus">
						<rim:ValueList>
							<rim:Value>urn:oasis:names:tc:ebxml-regrep:StatusType:Deprecated</rim:Value>
						</rim:ValueList>
					</rim:Slot>
					<rim:Slot name="OriginalStatus">
						<rim:ValueList>
							<rim:Value>urn:oasis:names:tc:ebxml-regrep:StatusType:Approved</rim:Value>
						</rim:ValueList>
					</rim:Slot>
				</rim:Association>

			</rim:RegistryObjectList>
		</lcm:SubmitObjectsRequest>
	</s:Body>
</s:Envelope>